Revit 2026 API

# IDuplicateTypeNamesHandler Interface

---

An interface for custom handlers of duplicate type names encountered during a paste operation. When the destination document contains types that have the same names as the types being copied, but different internals, a decision must be made on how to proceed - whether to cancel the operation or continue, but only copy types with unique names.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IDuplicateTypeNamesHandler
```
```vb
Public Interface IDuplicateTypeNamesHandler
```
```cpp
public interface class IDuplicateTypeNamesHandler
```
```fsharp
type IDuplicateTypeNamesHandler = interface end
```

The IDuplicateTypeNamesHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnDuplicateTypeNamesFound | Called when the destination document contains types with the same names as the types being copied. |

#### Reference

Autodesk.Revit.DB Namespace